// GenBlkBrick
for(var v0 = 0;(v0) < (16);v0++){
// GenBlkBrick
for(var v1 = 0;(v1) < (16);v1++){
function v2(v1, v2){
(v1[0]) = 1.1;
v2.x;
(v1[0]) = 2.3023e-320;
}
}
}
var v3 = ({adlm : "𞥐𞥑𞥒𞥓𞥔𞥕𞥖𞥗𞥘𞥙", ahom : "𑜰𑜱𑜲𑜳𑜴𑜵𑜶𑜷𑜸𑜹", arab : "٠١٢٣٤٥٦٧٨٩", arabext : "۰۱۲۳۴۵۶۷۸۹", bali : "\u1B50\u1B51\u1B52\u1B53\u1B54\u1B55\u1B56\u1B57\u1B58\u1B59", beng : "০১২৩৪৫৬৭৮৯", bhks : "𑱐𑱑𑱒𑱓𑱔𑱕𑱖𑱗𑱘𑱙", brah : "𑁦𑁧𑁨𑁩𑁪𑁫𑁬𑁭𑁮𑁯", cakm : "𑄶𑄷𑄸𑄹𑄺𑄻𑄼𑄽𑄾𑄿", cham : "꩐꩑꩒꩓꩔꩕꩖꩗꩘꩙", deva : "०१२३४५६७८९", diak : "𑥐𑥑𑥒𑥓𑥔𑥕𑥖𑥗𑥘𑥙", fullwide : "０１２３４５６７８９", gong : "𑶠𑶡𑶢𑶣𑶤𑶥𑶦𑶧𑶨𑶩", gonm : "𑵐𑵑𑵒𑵓𑵔𑵕𑵖𑵗𑵘𑵙", gujr : "૦૧૨૩૪૫૬૭૮૯", guru : "੦੧੨੩੪੫੬੭੮੯", hanidec : "〇一二三四五六七八九", hmng : "𖭐𖭑𖭒𖭓𖭔𖭕𖭖𖭗𖭘𖭙", hmnp : "𞅀𞅁𞅂𞅃𞅄𞅅𞅆𞅇𞅈𞅉", java : "꧐꧑꧒꧓꧔꧕꧖꧗꧘꧙", kali : "꤀꤁꤂꤃꤄꤅꤆꤇꤈꤉", khmr : "០១២៣៤៥៦៧៨៩", knda : "೦೧೨೩೪೫೬೭೮೯", lana : "᪀᪁᪂᪃᪄᪅᪆᪇᪈᪉", lanatham : "᪐᪑᪒᪓᪔᪕᪖᪗᪘᪙", laoo : "໐໑໒໓໔໕໖໗໘໙", latn : "0123456789", lepc : "᱀᱁᱂᱃᱄᱅᱆᱇᱈᱉", limb : "\u1946\u1947\u1948\u1949\u194A\u194B\u194C\u194D\u194E\u194F", mathbold : "𝟎𝟏𝟐𝟑𝟒𝟓𝟔𝟕𝟖𝟗", mathdbl : "𝟘𝟙𝟚𝟛𝟜𝟝𝟞𝟟𝟠𝟡", mathmono : "𝟶𝟷𝟸𝟹𝟺𝟻𝟼𝟽𝟾𝟿", mathsanb : "𝟬𝟭𝟮𝟯𝟰𝟱𝟲𝟳𝟴𝟵", mathsans : "𝟢𝟣𝟤𝟥𝟦𝟧𝟨𝟩𝟪𝟫", mlym : "൦൧൨൩൪൫൬൭൮൯", modi : "𑙐𑙑𑙒𑙓𑙔𑙕𑙖𑙗𑙘𑙙", mong : "᠐᠑᠒᠓᠔᠕᠖᠗᠘᠙", mroo : "𖩠𖩡𖩢𖩣𖩤𖩥𖩦𖩧𖩨𖩩", mtei : "꯰꯱꯲꯳꯴꯵꯶꯷꯸꯹", mymr : "၀၁၂၃၄၅၆၇၈၉", mymrshan : "႐႑႒႓႔႕႖႗႘႙", mymrtlng : "꧰꧱꧲꧳꧴꧵꧶꧷꧸꧹", newa : "𑑐𑑑𑑒𑑓𑑔𑑕𑑖𑑗𑑘𑑙", nkoo : "߀߁߂߃߄߅߆߇߈߉", olck : "᱐᱑᱒᱓᱔᱕᱖᱗᱘᱙", orya : "୦୧୨୩୪୫୬୭୮୯", osma : "𐒠𐒡𐒢𐒣𐒤𐒥𐒦𐒧𐒨𐒩", rohg : "𐴰𐴱𐴲𐴳𐴴𐴵𐴶𐴷𐴸𐴹", saur : "꣐꣑꣒꣓꣔꣕꣖꣗꣘꣙", segment : "🯰🯱🯲🯳🯴🯵🯶🯷🯸🯹", shrd : "𑇐𑇑𑇒𑇓𑇔𑇕𑇖𑇗𑇘𑇙", sind : "𑋰𑋱𑋲𑋳𑋴𑋵𑋶𑋷𑋸𑋹", sinh : "෦෧෨෩෪෫෬෭෮෯", sora : "𑃰𑃱𑃲𑃳𑃴𑃵𑃶𑃷𑃸𑃹", sund : "᮰᮱᮲᮳᮴᮵᮶᮷᮸᮹", takr : "𑛀𑛁𑛂𑛃𑛄𑛅𑛆𑛇𑛈𑛉", talu : "᧐᧑᧒᧓᧔᧕᧖᧗᧘᧙", tamldec : "௦௧௨௩௪௫௬௭௮௯", telu : "౦౧౨౩౪౫౬౭౮౯", thai : "๐๑๒๓๔๕๖๗๘๙", tibt : "༠༡༢༣༤༥༦༧༨༩", tirh : "𑓐𑓑𑓒𑓓𑓔𑓕𑓖𑓗𑓘𑓙", vaii : "꘠꘡꘢꘣꘤꘥꘦꘧꘨꘩", wara : "𑣠𑣡𑣢𑣣𑣤𑣥𑣦𑣧𑣨𑣩", wcho : "𞋰𞋱𞋲𞋳𞋴𞋵𞋶𞋷𞋸𞋹"});
var v4 = new Array(1, 2, 3);
v2(v3, ({}));
var v5 = new Proxy([], v3);
// GenBlkBrick
for(let v0 = 0;(v0) < (100);v0++){
{
(v5[v0]) = new Array();
}
}
// GenBlkBrick
for(let v0 = 0;(v0) < (100);v0++){
var v6 = Array.isArray;
}
// GenBlkBrick
for(let v7 in v5){
{
(v8) = 0x1234;
function v8(){
}
}
{
v8();
}
}
